**PERFORM HYPOTHESIS TESTING OF DATA SET**

In this notebook i perform hypothesis testing with marketing_campaign dataset from kaggle : https://www.kaggle.com/datasets/rodsaldanha/arketing-campaign.  This data compile custumers profile to generate marketing campaign.
so, the hypotesist I needed to answer is :
*Does the customer's education level affect their average income?*

In [19]:
import pandas as pd
import numpy as np
import scipy.stats as st

In [20]:
df = pd.read_csv('marketing_campaign.csv', sep='\t')

this syntax aims to reads the dataset and fix the format from the delimiter so it will be easy to read

In [21]:
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

**Perform Data Cleaning**

In [22]:
df2 = df.copy()

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [24]:
#Remove rows of missing value
df2 = df.dropna()

In [25]:
df2.isna().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [26]:
df2.shape

(2216, 29)

**ANOVA TEST**

Step 1 : generates Hypotesis

- H0 : The average income for each education category is identical
- H1 : The average income for each education categry is significantly different

Step 2:  descriptive statistic

In [27]:
df2['Education'].unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

In [28]:
Graduation = df2[df2['Education'] == 'Graduation']
PhD = df2[df2['Education'] == 'PhD']
Master = df2[df2['Education'] == 'Master']
Basic = df2[df2['Education'] == 'Basic']
Second_Cycle = df2[df2['Education'] == '2n Cycle']

In [29]:
df2.Education.value_counts()

Graduation    1116
PhD            481
Master         365
2n Cycle       200
Basic           54
Name: Education, dtype: int64

In [30]:
Graduation['Income'].mean()

52720.37365591398

In [31]:
PhD['Income'].mean()

56145.31392931393

In [32]:
Basic['Income'].mean()

20306.25925925926

In [33]:
Second_Cycle['Income'].mean()

47633.19

Step 3 : Performing Anova Test

In [34]:
anova_test = st.f_oneway(Graduation['Income'],PhD['Income'],Master['Income'],Second_Cycle['Income'],Basic['Income'])

In [35]:
anova_test.pvalue

1.6677281316366318e-22

In [36]:
pvalue = anova_test.pvalue

Step 4 : Hypotesis Testing of H1 and H0

In [38]:
treshold = 0.05
if pvalue >= treshold:
    print('Insufficient to Reject H0: The average income is identical to education')
else :
    print('Sufficient to Reject H0: The avergae income is significantly different to education')

Sufficient to Reject H0: The avergae income is significantly different to education

**Summary**

Education does have impact to the averages income of the customers